# Brewfile - Homebrew Bundle for Mac Setup
# Run: brew bundle --file=Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# Essential Development Tools
brew "git"
brew "git-extras"
brew "gh"
brew "node"
brew "python@3.12"
brew "python@3.11"
brew "ruby"
brew "rust"
brew "go"

# Databases
brew "postgresql@16"
brew "sqlite"
brew "redis"

# DevOps & Cloud
brew "docker"
brew "docker-compose"
brew "terraform"
brew "awscli"
brew "kubectl"
brew "helm"
brew "k9s"

# Modern Development
brew "bun"        # Fast JS runtime
brew "deno"       # Modern JS/TS runtime
brew "uv"         # Fast Python package manager
brew "mise"       # Modern version manager

# AI/ML Tools
brew "ollama"     # Local LLM runner

# Network & System Tools
brew "curl"
brew "wget"
brew "htop"
brew "tree"
brew "watch"
brew "jq"
brew "httpie"
brew "nmap"
brew "mtr"

# Modern CLI Tools
brew "ripgrep"    # Better grep
brew "fzf"        # Fuzzy finder
brew "fd"         # Better find
brew "bat"        # Better cat
brew "eza"        # Better ls
brew "zoxide"     # Better cd
brew "bottom"     # Better htop
brew "procs"      # Better ps
brew "dust"       # Better du
brew "sd"         # Better sed
brew "delta"      # Better git diff
brew "lazygit"    # Git TUI

# Shell & Terminal
brew "zsh"
brew "tmux"
brew "starship"

# Security
brew "gnupg"
brew "pass"
brew "age"        # Modern encryption
brew "sops"       # Secrets management
brew "trivy"      # Security scanner
brew "gitleaks"   # Git secrets scanner

# Development Workflow
brew "direnv"     # Directory-based env vars
brew "tldr"       # Simplified man pages
brew "act"        # Run GitHub Actions locally

# Media & Utilities
brew "mas"        # Mac App Store CLI
brew "trash"      # Safe rm
brew "yt-dlp"     # Modern youtube-dl
brew "ffmpeg"
brew "imagemagick"

# Development Applications
cask "visual-studio-code"
cask "cursor"
cask "warp"       # AI-powered terminal
cask "iterm2"
cask "docker"
cask "postman"
cask "insomnia"   # REST client alternative
cask "proxyman"   # HTTP debugging
cask "android-studio"

# Browsers
cask "google-chrome"
cask "firefox"
cask "arc"

# Communication
cask "slack"
cask "discord"
cask "telegram"
cask "zoom"

# Productivity
cask "raycast"    # AI-powered launcher
cask "rectangle"
cask "dropbox"
cask "the-unarchiver"
cask "notion"

# Media
cask "vlc"
cask "spotify"

# Fonts
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-jetbrains-mono"
cask "font-cascadia-code"

# Mac App Store Apps (requires mas)
# mas "Xcode", id: 497799835
# mas "1Password 7", id: 1333542190
# mas "Magnet", id: 441258766